Revit 2027 API
BuiltInFailures.InaccurateFailures.InaccurateCurveBasedFamily Property
 Curve-Based Family is slightly off axis and may cause inaccuracies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InaccurateCurveBasedFamily { get; }
Public Shared ReadOnly Property InaccurateCurveBasedFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InaccurateCurveBasedFamily {
	FailureDefinitionId^ get ();
}
static member InaccurateCurveBasedFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InaccurateFailures Class
Autodesk.Revit.DB Namespace